DataProcessors/бит_ЗакрытиеПлатежногоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗакрытиеПлатежногоПериода</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыполнитьНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/бит_НачислениеПениПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_НачислениеПениПоЛицевымСчетам</Name>
			<BasedOn>
				<xr:Item>Document.бит_ОплатаКУ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачислениеПениПоПериодам</xr:Item>
				<xr:Item>InformationRegister.бит_ДопДанныеНачисленияПени</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачислениеПениПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПениПоПериодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисленияПени</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПериодыНачисленияПени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/бит_ЗакрытиеПлатежногоПериода/Ext/ObjectModule.bsl
#Область ЭкспортныеПроцедурыИФункции

// Процедура создает и заполняет документы начисления пени.
//
// Параметры:
// 		Индикатор - ЭлементФормы - показатель прогресса выполнения процедуры.
//		Надпись   - ЭлементФормы - текст. 
//
Процедура ВыполнитьНачисление(Индикатор,Улица,Здание)Экспорт	
	
	НачислятьПени   = НачислятьПени() ;
	
	Если Улица = Неопределено Или Улица = ПредопределенноеЗначение("Справочник.бит_СписокУлиц.ПустаяСсылка") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СписокУлиц.Ссылка КАК Улица,
		|	СписокДокументов.Ссылка КАК ДокументНачисления,
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_СписокУлиц КАК бит_СписокУлиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО бит_СписокУлиц.Ссылка = бит_ЛицевыеСчета.УлицаЛицевогоСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бит_НачислениеПениПоЛицевымСчетам.Ссылка КАК Ссылка,
		|			бит_НачислениеПениПоЛицевымСчетам.Улица КАК Улица
		|		ИЗ
		|			Документ.бит_НачислениеПениПоЛицевымСчетам КАК бит_НачислениеПениПоЛицевымСчетам
		|		ГДЕ
		|			бит_НачислениеПениПоЛицевымСчетам.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			И бит_НачислениеПениПоЛицевымСчетам.ЗакрытиеПериода
		|			И бит_НачислениеПениПоЛицевымСчетам.Организация = &Организация
		|			И НЕ бит_НачислениеПениПоЛицевымСчетам.ПометкаУдаления
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачислениеПениПоЛицевымСчетам.Ссылка,
		|			бит_НачислениеПениПоЛицевымСчетам.Улица) КАК СписокДокументов
		|		ПО бит_СписокУлиц.Ссылка = СписокДокументов.Улица
		|ГДЕ
		|	бит_ЛицевыеСчета.Организация = &Организация
		|	И НЕ бит_ЛицевыеСчета.НеВестиРасчетПени
		|ИТОГИ ПО
		|	Улица,
		|	ДокументНачисления";
		
		Запрос.УстановитьПараметр("Дата",ДатаЗакрытия);
		Запрос.УстановитьПараметр("Организация",Организация);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СписокУлиц.Ссылка КАК Улица,
		|	СписокДокументов.Ссылка КАК ДокументНачисления,
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_СписокУлиц КАК бит_СписокУлиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ПО бит_СписокУлиц.Ссылка = бит_ЛицевыеСчета.УлицаЛицевогоСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бит_НачислениеПениПоЛицевымСчетам.Ссылка КАК Ссылка,
		|			бит_НачислениеПениПоЛицевымСчетам.Улица КАК Улица
		|		ИЗ
		|			Документ.бит_НачислениеПениПоЛицевымСчетам КАК бит_НачислениеПениПоЛицевымСчетам
		|		ГДЕ
		|			бит_НачислениеПениПоЛицевымСчетам.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			И бит_НачислениеПениПоЛицевымСчетам.ЗакрытиеПериода
		|			И бит_НачислениеПениПоЛицевымСчетам.Организация = &Организация
		|			И НЕ бит_НачислениеПениПоЛицевымСчетам.ПометкаУдаления
		|		
		|		СГРУППИРОВАТЬ ПО
		|			бит_НачислениеПениПоЛицевымСчетам.Ссылка,
		|			бит_НачислениеПениПоЛицевымСчетам.Улица) КАК СписокДокументов
		|		ПО бит_СписокУлиц.Ссылка = СписокДокументов.Улица
		|ГДЕ
		|	бит_ЛицевыеСчета.Организация = &Организация
		|	И НЕ бит_ЛицевыеСчета.НеВестиРасчетПени
		|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &Улица
		|ИТОГИ ПО
		|	Улица,
		|	ДокументНачисления";
		
		Запрос.УстановитьПараметр("Дата",ДатаЗакрытия);
		Запрос.УстановитьПараметр("Организация",Организация);
		Запрос.УстановитьПараметр("Улица",Улица);
		
	КонецЕсли;	
	
	Если НачислятьПени Тогда
		
		ВыборкаУлиц = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если Не ВыборкаУлиц.Количество() = 0 Тогда
			ЗначениеИндикатора = 100/ВыборкаУлиц.Количество();
		Иначе
			ЗначениеИндикатора = 0;
		КонецЕсли;
		
		Пока ВыборкаУлиц.Следующий() Цикл
			
			УлицаЛС = ВыборкаУлиц.Улица;
			ВыборкаДокументов = ВыборкаУлиц.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДокументов.Следующий() Цикл
				МассивЛС = Новый Массив;
				ВыборкаЛС = ВыборкаДокументов.Выбрать();
				Пока ВыборкаЛС.Следующий() Цикл
					МассивЛС.Добавить(ВыборкаЛС.ЛицевойСчет);					 
				КонецЦикла;
				
				Если ВыборкаДокументов.ДокументНачисления = Null Тогда
					
					НовыЙОбъект = Документы.бит_НачислениеПениПоЛицевымСчетам.СоздатьДокумент();
					//19.11.2019 
					НовыЙОбъект.Дата            = КонецДня(бит_ОбщегоНазначения.ПолучитьДатуЗакрытия(ДатаЗакрытия, Организация)) - 43200;
					НовыЙОбъект.Организация     = Организация;
					НовыЙОбъект.Улица           = УлицаЛС;
					НовыЙОбъект.ЗакрытиеПериода = Истина;
					НовыЙОбъект.РассчитатьНачисленияПениПоЛицевымСчетам(МассивЛС);
					НовыЙОбъект.Комментарий		= "Документ сформирован автоматически обработкой ""Закрытие платежного периода""";
					
					Попытка
						Если НовыЙОбъект.ЛицевыеСчета.Количество() > 0 тогда	
							НовыЙОбъект.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;	
						
					Исключение
					КонецПопытки;
					
					Индикатор = Индикатор + ЗначениеИндикатора;
				Иначе
					
					ПолученныйОбъект = ВыборкаДокументов.ДокументНачисления.ПолучитьОбъект();
					ПолученныйОбъект.РассчитатьНачисленияПениПоЛицевымСчетам(МассивЛС);
					
					ПолученныйОбъект.Комментарий = "Документ сформирован автоматически обработкой ""Закрытие платежного периода""";
					
					Попытка
						ПолученныйОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						
					КонецПопытки;
				КонецЕсли;
				
				Индикатор = Индикатор + ЗначениеИндикатора;
				
			КонецЦикла; 
		КонецЦикла; 
		
	Иначе

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Начисление невозможно");
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция выполняет проверку настроек ЖКХ.
//
// Параметры:
// 		Нет.
//
// Возвращаемое значение:
//   булево   - флаг начисления пени.
//
Функция НачислятьПени()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"	    , ДатаЗакрытия);
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.Текст  =
	"ВЫБРАТЬ
	|	НастройкаПараметровЖКХСрезПоследних.НачислятьПени КАК Начислять
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК НастройкаПараметровЖКХСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Начислять = Результат.Получить(Результат.Количество()-1).Начислять;
		
	Иначе
		
		Начислять = Ложь;
		
	КонецЕсли;
	
	Возврат Начислять;
	
КонецФункции

#КонецОбласти
